In [101]:
import numpy as np
import pandas as pd

In [102]:
df = pd.read_csv('../data/Superstore.csv' , encoding= 'unicode_escape' )
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,09-11-2013,12-11-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2013-152156,09-11-2013,12-11-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2013-138688,13-06-2013,17-06-2013,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2012-108966,11-10-2012,18-10-2012,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2012-108966,11-10-2012,18-10-2012,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [103]:
df1 = df.copy()

In [104]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   object
 3   Ship Date      9994 non-null   object
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9994 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9994 non-null   int64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9994 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9994 non-null   float64
 20  Profit         9994 non-null   float64
dtypes: float64(3), int64(3), object(15)
memory usage: 1.6+ MB

### Droping Unnecessary Columns

In [105]:
df1.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [106]:
df1 = df1.drop(columns= [ 'Row ID' , 'Order ID', 'Customer ID', 'Postal Code' , 'Product ID' ,  'Country' ])

In [107]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Date     9994 non-null   object
 1   Ship Date      9994 non-null   object
 2   Ship Mode      9994 non-null   object
 3   Customer Name  9994 non-null   object
 4   Segment        9994 non-null   object
 5   City           9994 non-null   object
 6   State          9994 non-null   object
 7   Region         9994 non-null   object
 8   Category       9994 non-null   object
 9   Sub-Category   9994 non-null   object
 10  Product Name   9994 non-null   object
 11  Sales          9994 non-null   float64
 12  Quantity       9994 non-null   int64
 13  Discount       9994 non-null   float64
 14  Profit         9994 non-null   float64
dtypes: float64(3), int64(1), object(11)
memory usage: 1.1+ MB

In [108]:
df1[['Order Date' , 'Ship Date']]

      Order Date   Ship Date
0     09-11-2013  12-11-2013
1     09-11-2013  12-11-2013
2     13-06-2013  17-06-2013
3     11-10-2012  18-10-2012
4     11-10-2012  18-10-2012
...          ...         ...
9989  22-01-2011  24-01-2011
9990  27-02-2014  04-03-2014
9991  27-02-2014  04-03-2014
9992  27-02-2014  04-03-2014
9993  05-05-2014  10-05-2014

[9994 rows x 2 columns]

### Extracting order month from order date

In [109]:
df1['Order Date'].str.split('-')

0       [09, 11, 2013]
1       [09, 11, 2013]
2       [13, 06, 2013]
3       [11, 10, 2012]
4       [11, 10, 2012]
             ...
9989    [22, 01, 2011]
9990    [27, 02, 2014]
9991    [27, 02, 2014]
9992    [27, 02, 2014]
9993    [05, 05, 2014]
Name: Order Date, Length: 9994, dtype: object

In [110]:
df1['order_month'] = df1['Order Date'].str.split('-').str.get(1)

### Extracting order year from order date

In [111]:
df1['Order Date'].str.split('-')

0       [09, 11, 2013]
1       [09, 11, 2013]
2       [13, 06, 2013]
3       [11, 10, 2012]
4       [11, 10, 2012]
             ...
9989    [22, 01, 2011]
9990    [27, 02, 2014]
9991    [27, 02, 2014]
9992    [27, 02, 2014]
9993    [05, 05, 2014]
Name: Order Date, Length: 9994, dtype: object

In [112]:
df1['order_year'] = df1['Order Date'].str.split('-').str.get(2)

In [113]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Date     9994 non-null   object
 1   Ship Date      9994 non-null   object
 2   Ship Mode      9994 non-null   object
 3   Customer Name  9994 non-null   object
 4   Segment        9994 non-null   object
 5   City           9994 non-null   object
 6   State          9994 non-null   object
 7   Region         9994 non-null   object
 8   Category       9994 non-null   object
 9   Sub-Category   9994 non-null   object
 10  Product Name   9994 non-null   object
 11  Sales          9994 non-null   float64
 12  Quantity       9994 non-null   int64
 13  Discount       9994 non-null   float64
 14  Profit         9994 non-null   float64
 15  order_month    9994 non-null   object
 16  order_year     9994 non-null   object
dtypes: float64(3), int64(1), object(13)
memory usage: 1.3+ MB

### Extracting shift month from shift date

In [114]:
df1['Ship Date'].str.split('-')

0       [12, 11, 2013]
1       [12, 11, 2013]
2       [17, 06, 2013]
3       [18, 10, 2012]
4       [18, 10, 2012]
             ...
9989    [24, 01, 2011]
9990    [04, 03, 2014]
9991    [04, 03, 2014]
9992    [04, 03, 2014]
9993    [10, 05, 2014]
Name: Ship Date, Length: 9994, dtype: object

In [115]:
df1['Ship Date'].str.split('-').str.get(1)

0       11
1       11
2       06
3       10
4       10
        ..
9989    01
9990    03
9991    03
9992    03
9993    05
Name: Ship Date, Length: 9994, dtype: object

In [116]:
df1['ship_month'] = df1['Ship Date'].str.split('-').str.get(1)

In [117]:
df1['ship_month']

0       11
1       11
2       06
3       10
4       10
        ..
9989    01
9990    03
9991    03
9992    03
9993    05
Name: ship_month, Length: 9994, dtype: object

### Extracting shift year from shift date

In [118]:
df1['Ship Date'].str.split('-')

0       [12, 11, 2013]
1       [12, 11, 2013]
2       [17, 06, 2013]
3       [18, 10, 2012]
4       [18, 10, 2012]
             ...
9989    [24, 01, 2011]
9990    [04, 03, 2014]
9991    [04, 03, 2014]
9992    [04, 03, 2014]
9993    [10, 05, 2014]
Name: Ship Date, Length: 9994, dtype: object

In [119]:
df1['Ship Date'].str.split('-').str.get(2)

0       2013
1       2013
2       2013
3       2012
4       2012
        ...
9989    2011
9990    2014
9991    2014
9992    2014
9993    2014
Name: Ship Date, Length: 9994, dtype: object

In [120]:
df1['ship_year'] = df1['Ship Date'].str.split('-').str.get(2)

In [121]:
df1['ship_year']

0       2013
1       2013
2       2013
3       2012
4       2012
        ...
9989    2011
9990    2014
9991    2014
9992    2014
9993    2014
Name: ship_year, Length: 9994, dtype: object

In [122]:
df1.head()

,Order Date,Ship Date,Ship Mode,Customer Name,Segment,City,State,Region,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,order_month,order_year,ship_month,ship_year
0,09-11-2013,12-11-2013,Second Class,Claire Gute,Consumer,Henderson,Kentucky,South,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136,11,2013,11,2013
1,09-11-2013,12-11-2013,Second Class,Claire Gute,Consumer,Henderson,Kentucky,South,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820,11,2013,11,2013
2,13-06-2013,17-06-2013,Second Class,Darrin Van Huff,Corporate,Los Angeles,California,West,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714,06,2013,06,2013
3,11-10-2012,18-10-2012,Standard Class,Sean O'Donnell,Consumer,Fort Lauderdale,Florida,South,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310,10,2012,10,2012
4,11-10-2012,18-10-2012,Standard Class,Sean O'Donnell,Consumer,Fort Lauderdale,Florida,South,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164,10,2012,10,2012

### Adding Cost column

In [123]:
round(df1['Sales'] - df1['Profit'] , 2)

0        220.05
1        512.36
2          7.75
3       1340.61
4         19.85
         ...
9989      21.15
9990      76.33
9991     239.18
9992      16.28
9993     170.21
Length: 9994, dtype: float64

In [124]:
df1['cost'] = round(df1['Sales'] - df1['Profit'] , 2)

### Adding Discount Amount column

In [125]:
round(df1['Sales'] * df1['Discount'] , 2)

0         0.00
1         0.00
2         0.00
3       430.91
4         4.47
         ...
9989      5.05
9990      0.00
9991     51.72
9992      0.00
9993      0.00
Length: 9994, dtype: float64

In [126]:
df1['discount_amount'] = round(df1['Sales'] * df1['Discount'] , 2)

### Changing Column Data Types

In [127]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Order Date       9994 non-null   object
 1   Ship Date        9994 non-null   object
 2   Ship Mode        9994 non-null   object
 3   Customer Name    9994 non-null   object
 4   Segment          9994 non-null   object
 5   City             9994 non-null   object
 6   State            9994 non-null   object
 7   Region           9994 non-null   object
 8   Category         9994 non-null   object
 9   Sub-Category     9994 non-null   object
 10  Product Name     9994 non-null   object
 11  Sales            9994 non-null   float64
 12  Quantity         9994 non-null   int64
 13  Discount         9994 non-null   float64
 14  Profit           9994 non-null   float64
 15  order_month      9994 non-null   object
 16  order_year       9994 non-null   object
 17  ship_month       9994 non-null   object
 18  ship_year        9994 non-null   object
 19  cost             9994 non-null   float64
 20  discount_amount  9994 non-null   float64
dtypes: float64(5), int64(1), object(15)
memory usage: 1.6+ MB

Order Date , Ship Date , order_month , order_year , ship_month , ship_year

In [128]:
# df1.astype({ 'order_month' : 'int64' , 'order_year' : 'int64' , 'ship_month' : 'int64' , 'ship_year' : 'int64' })

In [129]:
cols = ['order_month' , 'order_year' , 'ship_month' , 'ship_year']

for col in cols:
    df1[col] = df1[col].astype('int64')

In [130]:
df['Order Date']

0       09-11-2013
1       09-11-2013
2       13-06-2013
3       11-10-2012
4       11-10-2012
           ...
9989    22-01-2011
9990    27-02-2014
9991    27-02-2014
9992    27-02-2014
9993    05-05-2014
Name: Order Date, Length: 9994, dtype: object

In [131]:
df1[['Order Date' , 'Ship Date']] = df1[['Order Date' , 'Ship Date']].apply(pd.to_datetime , format= 'mixed' , dayfirst= True)

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   object
 3   Ship Date      9994 non-null   object
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9994 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9994 non-null   int64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9994 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9994 non-null   float64
 20  Profit         9994 non-null   float64
dtypes: float64(3), int64(3), object(15)
memory usage: 1.6+ MB

### Changing Column Names

In [133]:
df1.columns

Index(['Order Date', 'Ship Date', 'Ship Mode', 'Customer Name', 'Segment',
       'City', 'State', 'Region', 'Category', 'Sub-Category', 'Product Name',
       'Sales', 'Quantity', 'Discount', 'Profit', 'order_month', 'order_year',
       'ship_month', 'ship_year', 'cost', 'discount_amount'],
      dtype='object')

In [134]:
df1 = df1.rename(columns= {
    'Order Date' : 'order_date' ,
    'Ship Date' : 'ship_date' ,
    'Ship Mode' : 'ship_mode' ,
    'Customer Name' : 'customer_name' ,
    'Segment' : 'customer_segment' ,
    'City' : 'city' ,
    'State' : 'state' ,
    'Region' : 'region' ,
    'Category' : 'category' ,
    'Sub-Category' : 'sub_category' ,
    'Product Name' : 'product_name' ,
    'Sales' : 'sales' ,
    'Quantity' : 'quantity' ,
    'Discount' : 'discount' ,
    'Profit' : 'profit' 
})

### Dropping Duplicate values

In [135]:
df1.duplicated().sum()

np.int64(1)

In [136]:
df1[df1.duplicated()]

,order_date,ship_date,ship_mode,customer_name,customer_segment,city,state,region,category,sub_category,...,sales,quantity,discount,profit,order_month,order_year,ship_month,ship_year,cost,discount_amount
3406,2011-04-23,2011-04-27,Standard Class,Laurel Beltran,Home Office,Columbus,Ohio,East,Furniture,Chairs,...,281.372,2,0.3,-12.0588,4,2011,4,2011,293.43,84.41

In [137]:
df1[df1.customer_name == 'Laurel Beltran' ].duplicated()

3259    False
3405    False
3406     True
3407    False
3408    False
4724    False
4725    False
7481    False
7641    False
7642    False
7643    False
7644    False
8416    False
8417    False
8418    False
8419    False
8420    False
9170    False
9171    False
9172    False
9173    False
9702    False
9703    False
9704    False
dtype: bool

In [138]:
df1 = df1.drop_duplicates()

### Adding delivery time column

In [139]:
df1['delivery_time_in_days'] =(pd.to_datetime(df1['ship_date']) - pd.to_datetime(df1['order_date'])).dt.days

### Reordering Columns

In [140]:
df1 = df1[ ['customer_name' , 'customer_segment' , 'region', 'state', 'city', 'product_name', 'category', 'sub_category', 'order_date', 'order_month', 'order_year' , 'ship_date', 'ship_month' , 'ship_year' , 'delivery_time_in_days' , 'ship_mode' , 'sales' , 'quantity' , 'discount' , 'discount_amount' , 'cost' , 'profit'] ]

In [141]:
df1.columns

Index(['customer_name', 'customer_segment', 'region', 'state', 'city',
       'product_name', 'category', 'sub_category', 'order_date', 'order_month',
       'order_year', 'ship_date', 'ship_month', 'ship_year',
       'delivery_time_in_days', 'ship_mode', 'sales', 'quantity', 'discount',
       'discount_amount', 'cost', 'profit'],
      dtype='object')

In [142]:
df1.head()

,customer_name,customer_segment,region,state,city,product_name,category,sub_category,order_date,order_month,...,ship_month,ship_year,delivery_time_in_days,ship_mode,sales,quantity,discount,discount_amount,cost,profit
0,Claire Gute,Consumer,South,Kentucky,Henderson,Bush Somerset Collection Bookcase,Furniture,Bookcases,2013-11-09,11,...,11,2013,3,Second Class,261.9600,2,0.00,0.00,220.05,41.9136
1,Claire Gute,Consumer,South,Kentucky,Henderson,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",Furniture,Chairs,2013-11-09,11,...,11,2013,3,Second Class,731.9400,3,0.00,0.00,512.36,219.5820
2,Darrin Van Huff,Corporate,West,California,Los Angeles,Self-Adhesive Address Labels for Typewriters b...,Office Supplies,Labels,2013-06-13,6,...,6,2013,4,Second Class,14.6200,2,0.00,0.00,7.75,6.8714
3,Sean O'Donnell,Consumer,South,Florida,Fort Lauderdale,Bretford CR4500 Series Slim Rectangular Table,Furniture,Tables,2012-10-11,10,...,10,2012,7,Standard Class,957.5775,5,0.45,430.91,1340.61,-383.0310
4,Sean O'Donnell,Consumer,South,Florida,Fort Lauderdale,Eldon Fold 'N Roll Cart System,Office Supplies,Storage,2012-10-11,10,...,10,2012,7,Standard Class,22.3680,2,0.20,4.47,19.85,2.5164

### Convert Data Frame to new CSV file

In [143]:
df1.to_csv('../data/clean_super_store_data.csv' , index= False)

In [144]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9993 entries, 0 to 9993
Data columns (total 22 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_name          9993 non-null   object
 1   customer_segment       9993 non-null   object
 2   region                 9993 non-null   object
 3   state                  9993 non-null   object
 4   city                   9993 non-null   object
 5   product_name           9993 non-null   object
 6   category               9993 non-null   object
 7   sub_category           9993 non-null   object
 8   order_date             9993 non-null   datetime64[ns]
 9   order_month            9993 non-null   int64
 10  order_year             9993 non-null   int64
 11  ship_date              9993 non-null   datetime64[ns]
 12  ship_month             9993 non-null   int64
 13  ship_year              9993 non-null   int64
 14  delivery_time_in_days  9993 non-null   int64
 15  ship_mode              9993 non-null   object
 16  sales                  9993 non-null   float64
 17  quantity               9993 non-null   int64
 18  discount               9993 non-null   float64
 19  discount_amount        9993 non-null   float64
 20  cost                   9993 non-null   float64
 21  profit                 9993 non-null   float64
dtypes: datetime64[ns](2), float64(5), int64(6), object(9)
memory usage: 1.8+ MB